import { Link } from "react-router-dom";
import styles from '../Styles.module.css';

const ChineseStructure = () => {
    return (
        <div>
            <h3>音节 Структура китайского языка</h3>
            <p>
                Слог — это ритмическая единица, занимающая промежуточное положение между 
                отдельным звуком и словом. Слово в китайском языке может состоять из одного 
                или нескольких слогов.
            </p>
            <p>
                Слог является основной фонетической единицей китайского языка и имеет 
                достаточно жесткую структуру. Он состоит из <b>инициали</b> (начальный 
                согласный) и <b>финали</b> (остальная часть слога), каждый слог обычно 
                произносится с каким-либо <b>тоном</b>. Например, слог, записываемый
                в пиньинь как <b>bā</b>, состоит из инициали <b>b</b>, финали <b>a</b> и 
                произносится с первым тоном. Знак тона ставится над основным гласным 
                финали.
            </p>
            <p>
                В слоге может отсутствовать инициаль, но финаль, за редким исключением,
                присутствует обязательно. Слоги без инициали, называются <b>слогами с 
                нулевой инициалью</b>. Если инициаль есть, то она состоит только из одного 
                согласного, дифтонга или трифтонга.
            </p>
            <p>
                В конце финали не может быть никаких согласных кроме переднеязычного носового <b>n</b>, 
                заднеязычного носового <b>ng</b> и согласного <b>r</b>.
            </p>
            <p>
                В определенном контексте некоторые слоги могут произноситься без тона.
                Такие слоги называются <b>слогами с нейтральным (или легким) тоном.</b>
            </p>
            <p>
                Не все инициали сочетаются со всеми финалями. В современном китайском языке 
                без учета тоновых различий насчитывается более 400 слогов, а с учетом тоновых 
                различий (четыре тона и нейтральный тон) — около 1300. Поэтому одной из 
                особенностей китайского языка является регулярная ононимия на уровне слога. 
                Ононимия, как правило, исчезает на уровне многосложного слова, 
                словосочетания или предложения.
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson1/pinyin'>⟵</Link>
                <Link className={styles.arrow} to='/lesson1/initials_l1'>⟶</Link>
            </div>
        </div>
    );
}

export default ChineseStructure;