import { Link } from "react-router-dom";
import styles from '../Styles.module.css';

const InitialsL1 = () => {
    return (
        <div className={styles.blog}>
            <h3>声母 Инициали: b, p, d, t, g, k, h</h3>
            <p>
                В современном китайском языке согласные делятся на <b>полузвонкие</b> и <b>глухие
                придыхательные</b>. Полузвонкие согласные произносятся без вибрации голосовых
                связок и с сильным придыханием.
            </p>
            <h4>b</h4>
            <p>
                Этот звук по своей артикуляции похож на русский согласный <b>б</b>, но
                при произнесении китайского <b>b</b> голосовые связки не вибрируют.
                Этот согласный воспринимается русскоговорящими как нечто среднее между
                русским звонким <b>б</b> и глухим <b>п</b>.
            </p>
            <p>
                По звучанию полузвонкие китайские согласные напоминают соответствующие
                русские глухие согласные в положении между двумя гласными, как в
                словах о<b>п</b>ал, а<b>т</b>а<b>к</b>а.
            </p>
            <p>
                При отработке произношения китайского <b>b</b> рекомендуется настроиться на
                произнесение русского глухого <b>п</b>, но в самый последний момент
                произнести звонкий <b>б</b>, при этом голосовые связки не должны
                вибрировать.
            </p>
            <h4>p</h4>
            <p>
                Этот придыхательный глухой согласный по месту образования полностью сходен
                с парным ему полузвонким согласным <b>b</b> и отличается от него наличием
                придыхания.
            </p>
            <h4>d</h4>
            <p>
                Артикуляция согласного <b>d</b> напоминает артикуляцию русского согласного <b>д</b>,
                но китайский <b>d</b> является полузвонким и при его произнесении кончик языка
                касается альвеол, а не верхних зубов.
            </p>
            <p>
                При отработке произношения китайского <b>d</b> рекомендуется настроиться на
                произнесение русского глухого <b>т</b>, но в самый последний момент
                произнести звонкий <b>д</b>, при этом голосовые связки не должны вибрировать.
            </p>
            <h4>t</h4>
            <p>
                По месту образования глухой придыхательный согласный <b>t</b> идентичен
                полузвонкому <b>d</b> и отличается от последнего наличием придыхания.
            </p>
            <h4>g</h4>
            <p>
                По сравнению с русским звонким звуком <b>г</b> китайский
                полузвонкий <b>g</b> является более задним, то есть место смычки языка
                с небом сдвинуто больше назад.
            </p>
            <p>
                При отработке произношения китайского <b>g</b> рекомендуется настроиться
                на произнесение русского глухого <b>к</b>, но в самый последний момент
                произнести звонкий <b>г</b>, при этом голосовые связки не должны вибрировать.
            </p>
            <h4>k</h4>
            <p>
                Глухой согласный <b>k</b> по своей артикуляции сходен с полузвонким согласным
                звуком <b>g</b>, отличаясь от него лишь наличием придыхания.
            </p>
            <h4>h</h4>
            <p>
                Китайский согласный звук <b>h</b> произносится с меньшим напряжением, чем
                русский согласный <b>х</b>.
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson1/chinese_structure'>⟵</Link>
                <Link className={styles.arrow} to='/lesson1/finals_l1'>⟶</Link>
            </div>
        </div>
    );
}

export default InitialsL1;