import styles from '../Styles.module.css';
import { Link } from "react-router-dom";

const WritingHCL1 = () => {
    return (
        <div className={styles.blog}>
            <h3>书写笔画注意事项 Основные принципы написания иероглифических черт</h3>
            <h4>1. Иероглиф должен вписываться в квадрат</h4>
            <p>
                Иероглиф любой сложности независимо от количества черт, его составляющих,
                должен вписываться в квадрат заданного размера, располагаясь симметрично
                относительно его центра. Так, каждый из нижеследующих иероглифов
                一 yī 'один', 人 rén 'человек' и 众 zhòng 'толпа, много' должен быть вписан
                в квадрат одного и того же размера.
            </p>
            <h4>2. Иероглифическая черта пишется в один прием</h4>
            <p>
                Все черты, включая лигатуры, должны писаться одним движением, не сливаясь
                с предыдущей и последующей чертами.
            </p>
            <h4>3. Направление начертания иероглифических черт фиксированно</h4>
            <p>
                Каждая черта имеет свое направление начертания:
            </p>
            <ul>
                <li>вертикальные черты пишутся сверху вниз;</li>
                <li>горизонтальные черты пишутся слева направо;</li>
                <li>только откидная вверх пишется снизу вверх.</li>
            </ul>
            <p>
                Точки в иероглифе пишутся как короткие черты, также имеющие свое направление
                начертания. Различают два вида точек: точка влево и точка вправо. Так,
                в иероглифе 杰 'выдающийся' снизу пишутся 4 точки, из которых самая левая
                — это точка влево, а три остальные — точки вправо.
            </p>
            <h4>4. Взаиморасположение иероглифических черт</h4>
            <p>
                Иероглифические черты могут <b>пересекаться</b>, а могут
                лишь <b>соприкасаться</b> друг с другом. Взаиморасположение иероглифических
                черт нарушать нельзя: существует достаточно большое количество знаков,
                отличающихся друг от друга только по этому признаку. Сравните следующие пары
                иероглифов: 工 gōng 'работа' и 干 gān 'сухой', 午 wǔ 'полдень' и 牛 niú
                'корова', 刀 dāo 'нож' и 力 lì 'сила' и т.д.
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson1/hieroglyphic_characters'>⟵</Link>
                <Link className={styles.arrow} to='/lesson1/order_writing_hcl1'>⟶</Link>
            </div>
        </div>
    );
}

export default WritingHCL1;