import styles from '../Styles.module.css';
import { Link } from 'react-router-dom';

const FinalsL2 = () => {
    return (
        <div className={styles.blog}>
            <h3>韵母 Финали: i, u, ü</h3>
            <h4>i</h4>
            <p>
                Неогубленный гласный <b>i</b> похож на гласный звук <b>и</b> в 
                словах <b>мир</b> и <b>рис</b>, но в китайском языке согласный, 
                предшествующий <b>i</b>, не смягчается. Особое внимание следует 
                обратить на произношение слогов <b>di</b> и <b>ti</b>. В русском 
                языке перед гласными переднего 
                ряда <b>и</b> и <b>е</b> согласные <b>д</b> и <b>т</b> смягчаются, а в 
                китайском нет.
            </p>
            <h4>u</h4>
            <p>
                При произнесении огубленного гласного <b>u</b> язык занимает 
                более переднее положение, чем при произнесении русского <b>у</b>.
            </p>
            <h4>ü</h4>
            <p>
                Огубленный гласный <b>ü</b> по месту артикуляции совпадает с 
                гласным <b>i</b>. Для правильного произнесения этого гласного 
                нужно сначала настроиться на произнесение <b>i</b>, а затем в 
                последний момент, округлив губы, попытаться произнести <b>u</b>.
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson2/initials_l2'>⟵</Link>
                <Link className={styles.arrow} to='/lesson2/writing_syllables_in_pinyin'>⟶</Link>
            </div>
        </div>
    );
}

export default FinalsL2;