import styles from '../Styles.module.css';
import { Link } from 'react-router-dom';

const HieroglyphStructureL2 = () => {
    return (
        <div>
            <h3>汉字结构 Структура иероглифа</h3>
            <h4>1. Графемы, простые и сложные иероглифы</h4>
            <p>
                Все иероглифы можно разделить на два структурных 
                класса: <b>простые</b> и <b>сложные</b>.
            </p>
            <p>
                <b>Простые иероглифы</b> представляют собой элементарные знаки, обладающие 
                значением, но не делящиеся на имеющие значение структурные части.
            </p>
            <p>
                <b>Сложные иероглифы</b> состоят из нескольких структурных частей, каждая из 
                которых, как правило, имеет значение.
            </p>
            <p>
                Простой иероглиф может употребляться самостоятельно, записывая односложное 
                слово (人 rén 'человек', 山 shān 'гора', 马 mǎ 'лошадь') или же 
                выступать как структурная часть сложного иероглифа (сложный иероглиф 众 
                zhòng 'толпа, много' состоит из трех простых иероглифов 人 rén 'человек').
            </p>
            <p>
                Существуют также структурные элементы иероглифов, обладающие значением, но 
                как отдельный иероглиф не употребляющиеся: в иероглифе 国 guó 'государство' 
                графический элемент 囗 wéi (внешний контур знака) имеет значение 'ограда', но 
                самостоятельно никогда не употребляется.
            </p>
            <p>
                Простые иероглифы и несамостоятельные структурные элементы иероглифов, 
                обладающие значением, называются общим термином <b>графема</b>. Графемы делятся 
                только на иероглифические черты. Простой иероглиф состоит из одной графемы, а 
                сложный представляет собой комбинацию двух или трех графем. Общее количество 
                графем сравнительно невелико — около 1500, а наиболее употребительных 
                насчитывается чуть более 200. Любой, даже самый сложный иероглиф представляет 
                собой комбинацию графем из этого множества.
            </p>
            <h4>2. Типы графических структур сложных иероглифов</h4>
            <p>
                Существуют три основных типа графических структур сложных иероглифов:
            </p>
            <p>
                <b>1) Вертикальная структура:</b> 吕 lǚ 'звукоряд'. Иероглифы этого структурного 
                типа делятся на верхнюю и нижнюю части.
            </p>
            <p>
                <b>2) Горизонтальная структура:</b> 妈 mā 'мама'. Иероглифы этого структурного 
                типа делятся на левую и правую части.
            </p>
            <p>
                <b>3) Охватывающая структура:</b> 国 guó 'государство'. Иероглифы этого структурного 
                типа делятся на внешний контур и элементы внутри этого контура. 
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson2/order_writing_hcl2'>⟵</Link>
                <Link className={styles.arrow} to='/lesson2/hieroglyphs_table_l2'>⟶</Link>
            </div>
        </div>
    );
}

export default HieroglyphStructureL2;