import styles from '../Styles.module.css';
import { Link } from 'react-router-dom';

const InitialsL2 = () => {
    return (
        <div className={styles.blog}>
            <h3>声母 Инициали: m, f, n, l</h3>
            <h4>m</h4>
            <p>
                Китайский носовой согласный <b>m</b> артикулируется так же, как и 
                русский согласный <b>м</b>, только с большей напряженностью и длительностью.
            </p>
            <h4>f</h4>
            <p>
                Китайский глухой согласный <b>f</b> по своей артикуляции 
                близок к русскому согласному <b>ф</b>, но отличается от него большей 
                интенсивностью и длительностью.
            </p>
            <h4>n</h4>
            <p>
                Китайский переднеязычный носовой согласный <b>n</b> является 
                альвеолярным, при его артикуляции язык касается альвеол — части 
                нёба сразу над верхними зубами. Китайский <b>n</b> отличается по 
                своему произношению как от русского мягкого <b>н'</b>, так и от 
                твёрдого <b>н</b>, так как оба русских согласных являются зубными.
            </p>
            <h4>l</h4>
            <p>
                Китайский согласный <b>l</b> отличается по своему произношению от 
                русского твёрдого <b>л</b> и от мягкого <b>л'</b>. Оба русских согласных 
                являются зубными, а китайский <b>l</b> — альвеолярным, при этом лишь кончик 
                языка касается альвеол.
            </p>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson2/finals_l2'>⟶</Link>
            </div>
        </div>
    );
}

export default InitialsL2;