import styles from '../Styles.module.css';
import { Link } from 'react-router-dom';

const WritingSyllablesInPinyinL2 = () => {
    return (
        <div>
            <h3>音节的拼写规则 Правила записи слогов в пиньинь и некоторые особенности 
            их произнесения</h3>
            <p>
                <b>1.</b> При записи тона над гласным <b>i</b> точка не ставится: bǐ, lì, mí, nǐ.
            </p>
            <p>
                <b>2.</b> Точки над <b>ü</b> ставятся только после инициалей n и l, 
                после которых возможны как <b>u</b>, так и <b>ü</b>, другими словами, 
                точки над ü ставятся только в следующих слогах: nü, nüe, lü и lüe.
            </p>
            <p>
                <b>3.</b> Гласные <b>i</b>, <b>u</b> и <b>ü</b> могут самостоятельно 
                образовывать слог. В этом случае эти слоги записываются 
                как <b>yi</b>, <b>wu</b>, и <b>yu</b> соответственно, в последнем слоге точки 
                над u не ставятся.
            </p>
            <p>
                <i>
                    Обратите внимание на следующие особенности произношения слогов 
                    с нулевой инициалью:
                </i>
            </p>
            <ul>
                <li>
                    слог <b>yi</b> произносится с напряжением в самом начале слога, 
                    похожим на очень легкий <b>й</b>-образный призвук;
                </li>
                <li>
                    слог <b>wu</b> произносится с более активной работой губ, в 
                    результате чего в начале слога получается напряженный звук, 
                    похожий на английское <b>w</b>;
                </li>
                <li>
                    слог <b>yu</b> произносится с напряжением в самом начале слога, 
                    похожим на очень легкий <b>й</b>-образный призвук.
                </li>
            </ul>
            <div className={styles.next_back}>
                <Link className={styles.arrow} to='/lesson2/finals_l2'>⟵</Link>
                <Link className={styles.arrow} to='/lesson2/hieroglyphic_characters_l2'>⟶</Link>
            </div>
        </div>
    );
}

export default WritingSyllablesInPinyinL2;