function Home() {
    return (
        <div>
            <h1>Добро пожаловать на курсы китайского языка!</h1>
            <p>
                Данный сайт предназначен для всех желающих приступить к изучению китайского языка.
                Здесь можно:
            </p>
            <ul>
                <li>
                    освоить нормативное китайское произношение
                </li>
                <li>
                    овладеть пониманием китайской речи на слух
                </li>
                <li>
                    овладеть основами иероглифики и научиться правильно писать по-китайски
                </li>
                <li>
                    получить и отработать навыки правильной разговорной речи на самые разные темы,
                    включая бытовую и деловую тематику
                </li>
                <li>
                    овладеть базовой грамматикой и основными грамматическими конструкциями
                </li>
                <li>
                    добиться хороших базовых навыков чтения на китайском языке
                </li>
                <li>
                    овладеть лексикой в пределах, требуемых 3-м уровнем HSK и выше
                </li>
            </ul>
        </div>
    );
}

export default Home;